Revit 2025 API
BendingDetailBendDiameterDimensionType Enumeration
 Describes the dimension type for bend diameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BendingDetailBendDiameterDimensionType
Public Enumeration BendingDetailBendDiameterDimensionType
public enum class BendingDetailBendDiameterDimensionType
type BendingDetailBendDiameterDimensionType
Members
Member name | Value | Description
Radial | 0 |  Radial Dimension Type
Diameter | 1 |  Diameter Dimension Type
See Also
Reference
Autodesk.Revit.DB.Structure Namespace